{
    "word_to_id": {
        "ai\"": 0,
        "redirects": 1,
        "here.": 2,
        "for": 3,
        "other": 4,
        "uses,": 5,
        "see": 6,
        "ai": 7,
        "and": 8,
        "artificial": 9,
        "intelligence": 10,
        ".": 11,
        "is": 12,
        "the": 13,
        "capability": 14,
        "of": 15,
        "computational": 16,
        "systems": 17,
        "to": 18,
        "perform": 19,
        "tasks": 20,
        "typically": 21,
        "associated": 22,
        "with": 23,
        "human": 24,
        "intelligence,": 25,
        "such": 26,
        "as": 27,
        "learning,": 28,
        "reasoning,": 29,
        "problem-solving,": 30,
        "perception,": 31,
        "decision-making.": 32,
        "it": 33,
        "a": 34,
        "field": 35,
        "research": 36,
        "in": 37,
        "computer": 38,
        "science": 39,
        "that": 40,
        "develops": 41,
        "studies": 42,
        "methods": 43,
        "software": 44,
        "enable": 45,
        "machines": 46,
        "perceive": 47,
        "their": 48,
        "environment": 49,
        "use": 50,
        "learning": 51,
        "take": 52,
        "actions": 53,
        "maximize": 54,
        "chances": 55,
        "achieving": 56,
        "defined": 57,
        "goals.[1]": 58,
        "high-profile": 59,
        "applications": 60,
        "include": 61,
        "advanced": 62,
        "web": 63,
        "search": 64,
        "engines": 65,
        ";": 66,
        "recommendation": 67,
        "virtual": 68,
        "assistants": 69,
        "autonomous": 70,
        "vehicles": 71,
        "generative": 72,
        "creative": 73,
        "tools": 74,
        "superhuman": 75,
        "play": 76,
        "analysis": 77,
        "strategy": 78,
        "games": 79,
        "however,": 80,
        "many": 81,
        "are": 82,
        "not": 83,
        "perceived": 84,
        "ai:": 85,
        "\"a": 86,
        "lot": 87,
        "cutting": 88,
        "edge": 89,
        "has": 90,
        "filtered": 91,
        "into": 92,
        "general": 93,
        "applications,": 94,
        "often": 95,
        "without": 96,
        "being": 97,
        "called": 98,
        "because": 99,
        "once": 100,
        "something": 101,
        "becomes": 102,
        "useful": 103,
        "enough": 104,
        "common": 105,
        "it's": 106,
        "labeled": 107,
        "anymore.\"3]": 108,
        "various": 109,
        "subfields": 110,
        "centered": 111,
        "around": 112,
        "particular": 113,
        "goals": 114,
        "tools.": 115,
        "traditional": 116,
        "knowledge": 117,
        "representation,": 118,
        "planning,": 119,
        "natural": 120,
        "language": 121,
        "processing,": 122,
        "support": 123,
        "robotics.[a]": 124,
        "reach": 125,
        "these": 126,
        "goals,": 127,
        "researchers": 128,
        "have": 129,
        "adapted": 130,
        "integrated": 131,
        "wide": 132,
        "range": 133,
        "techniques,": 134,
        "including": 135,
        "mathematical": 136,
        "optimization,": 137,
        "formal": 138,
        "logic,": 139,
        "neural": 140,
        "networks,": 141,
        "based": 142,
        "on": 143,
        "statistics,": 144,
        "operations": 145,
        "research,": 146,
        "economics.[b]": 147,
        "also": 148,
        "draws": 149,
        "upon": 150,
        "psychology,": 151,
        "linguistics,": 152,
        "philosophy,": 153,
        "neuroscience,": 154,
        "fields.[4]": 155,
        "some": 156,
        "companies,": 157,
        "openai,": 158,
        "google": 159,
        "deepmind": 160,
        "meta,[5]": 161,
        "aim": 162,
        "create": 163,
        "\u2014ai": 164,
        "can": 165,
        "complete": 166,
        "virtually": 167,
        "any": 168,
        "cognitive": 169,
        "task": 170,
        "at": 171,
        "least": 172,
        "well": 173,
        "human.": 174,
        "was": 175,
        "founded": 176,
        "an": 177,
        "academic": 178,
        "discipline": 179,
        "1956,[6]": 180,
        "went": 181,
        "through": 182,
        "multiple": 183,
        "cycles": 184,
        "optimism": 185,
        "throughout": 186,
        "its": 187,
        "history,8]": 188,
        "followed": 189,
        "by": 190,
        "periods": 191,
        "disappointment": 192,
        "loss": 193,
        "funding,": 194,
        "known": 195,
        "winters.10]": 196,
        "funding": 197,
        "interest": 198,
        "vastly": 199,
        "increased": 200,
        "after": 201,
        "2012": 202,
        "when": 203,
        "graphics": 204,
        "processing": 205,
        "units": 206,
        "started": 207,
        "used": 208,
        "accelerate": 209,
        "deep": 210,
        "outperformed": 211,
        "previous": 212,
        "techniques.[11]": 213,
        "this": 214,
        "growth": 215,
        "accelerated": 216,
        "further": 217,
        "2017": 218,
        "transformer": 219,
        "architecture.[12]": 220,
        "2020s,": 221,
        "ongoing": 222,
        "period": 223,
        "rapid": 224,
        "progress": 225,
        "became": 226,
        "boom.": 227,
        "ai's": 228,
        "ability": 229,
        "modify": 230,
        "content": 231,
        "led": 232,
        "several": 233,
        "unintended": 234,
        "consequences": 235,
        "harms.": 236,
        "ethical": 237,
        "concerns": 238,
        "been": 239,
        "raised": 240,
        "about": 241,
        "long-term": 242,
        "effects": 243,
        "potential": 244,
        "existential": 245,
        "risks,": 246,
        "prompting": 247,
        "discussions": 248,
        "regulatory": 249,
        "policies": 250,
        "ensure": 251,
        "safety": 252,
        "benefits": 253,
        "technology.": 254,
        "he": 255,
        "problem": 256,
        "simulating": 257,
        "broken": 258,
        "subproblems.": 259,
        "consist": 260,
        "traits": 261,
        "or": 262,
        "capabilities": 263,
        "expect": 264,
        "intelligent": 265,
        "system": 266,
        "display.": 267,
        "described": 268,
        "below": 269,
        "received": 270,
        "most": 271,
        "attention": 272,
        "cover": 273,
        "scope": 274,
        "research.[a]": 275,
        "reasoning": 276,
        "problem-solving": 277,
        "early": 278,
        "developed": 279,
        "algorithms": 280,
        "imitated": 281,
        "step-by-step": 282,
        "humans": 283,
        "they": 284,
        "solve": 285,
        "puzzles": 286,
        "make": 287,
        "logical": 288,
        "deductions.[13]": 289,
        "late": 290,
        "1980s": 291,
        "1990s,": 292,
        "were": 293,
        "dealing": 294,
        "uncertain": 295,
        "incomplete": 296,
        "information,": 297,
        "employing": 298,
        "concepts": 299,
        "from": 300,
        "probability": 301,
        "economics.[14]": 302,
        "insufficient": 303,
        "solving": 304,
        "large": 305,
        "problems": 306,
        "experience": 307,
        "\"combinatorial": 308,
        "explosion\":": 309,
        "become": 310,
        "exponentially": 311,
        "slower": 312,
        "grow.[15]": 313,
        "even": 314,
        "rarely": 315,
        "deduction": 316,
        "could": 317,
        "model.": 318,
        "using": 319,
        "fast,": 320,
        "intuitive": 321,
        "judgments.[16]": 322,
        "accurate": 323,
        "efficient": 324,
        "unsolved": 325,
        "problem.": 326
    },
    "id_to_word": {
        "0": "ai\"",
        "1": "redirects",
        "2": "here.",
        "3": "for",
        "4": "other",
        "5": "uses,",
        "6": "see",
        "7": "ai",
        "8": "and",
        "9": "artificial",
        "10": "intelligence",
        "11": ".",
        "12": "is",
        "13": "the",
        "14": "capability",
        "15": "of",
        "16": "computational",
        "17": "systems",
        "18": "to",
        "19": "perform",
        "20": "tasks",
        "21": "typically",
        "22": "associated",
        "23": "with",
        "24": "human",
        "25": "intelligence,",
        "26": "such",
        "27": "as",
        "28": "learning,",
        "29": "reasoning,",
        "30": "problem-solving,",
        "31": "perception,",
        "32": "decision-making.",
        "33": "it",
        "34": "a",
        "35": "field",
        "36": "research",
        "37": "in",
        "38": "computer",
        "39": "science",
        "40": "that",
        "41": "develops",
        "42": "studies",
        "43": "methods",
        "44": "software",
        "45": "enable",
        "46": "machines",
        "47": "perceive",
        "48": "their",
        "49": "environment",
        "50": "use",
        "51": "learning",
        "52": "take",
        "53": "actions",
        "54": "maximize",
        "55": "chances",
        "56": "achieving",
        "57": "defined",
        "58": "goals.[1]",
        "59": "high-profile",
        "60": "applications",
        "61": "include",
        "62": "advanced",
        "63": "web",
        "64": "search",
        "65": "engines",
        "66": ";",
        "67": "recommendation",
        "68": "virtual",
        "69": "assistants",
        "70": "autonomous",
        "71": "vehicles",
        "72": "generative",
        "73": "creative",
        "74": "tools",
        "75": "superhuman",
        "76": "play",
        "77": "analysis",
        "78": "strategy",
        "79": "games",
        "80": "however,",
        "81": "many",
        "82": "are",
        "83": "not",
        "84": "perceived",
        "85": "ai:",
        "86": "\"a",
        "87": "lot",
        "88": "cutting",
        "89": "edge",
        "90": "has",
        "91": "filtered",
        "92": "into",
        "93": "general",
        "94": "applications,",
        "95": "often",
        "96": "without",
        "97": "being",
        "98": "called",
        "99": "because",
        "100": "once",
        "101": "something",
        "102": "becomes",
        "103": "useful",
        "104": "enough",
        "105": "common",
        "106": "it's",
        "107": "labeled",
        "108": "anymore.\"3]",
        "109": "various",
        "110": "subfields",
        "111": "centered",
        "112": "around",
        "113": "particular",
        "114": "goals",
        "115": "tools.",
        "116": "traditional",
        "117": "knowledge",
        "118": "representation,",
        "119": "planning,",
        "120": "natural",
        "121": "language",
        "122": "processing,",
        "123": "support",
        "124": "robotics.[a]",
        "125": "reach",
        "126": "these",
        "127": "goals,",
        "128": "researchers",
        "129": "have",
        "130": "adapted",
        "131": "integrated",
        "132": "wide",
        "133": "range",
        "134": "techniques,",
        "135": "including",
        "136": "mathematical",
        "137": "optimization,",
        "138": "formal",
        "139": "logic,",
        "140": "neural",
        "141": "networks,",
        "142": "based",
        "143": "on",
        "144": "statistics,",
        "145": "operations",
        "146": "research,",
        "147": "economics.[b]",
        "148": "also",
        "149": "draws",
        "150": "upon",
        "151": "psychology,",
        "152": "linguistics,",
        "153": "philosophy,",
        "154": "neuroscience,",
        "155": "fields.[4]",
        "156": "some",
        "157": "companies,",
        "158": "openai,",
        "159": "google",
        "160": "deepmind",
        "161": "meta,[5]",
        "162": "aim",
        "163": "create",
        "164": "\u2014ai",
        "165": "can",
        "166": "complete",
        "167": "virtually",
        "168": "any",
        "169": "cognitive",
        "170": "task",
        "171": "at",
        "172": "least",
        "173": "well",
        "174": "human.",
        "175": "was",
        "176": "founded",
        "177": "an",
        "178": "academic",
        "179": "discipline",
        "180": "1956,[6]",
        "181": "went",
        "182": "through",
        "183": "multiple",
        "184": "cycles",
        "185": "optimism",
        "186": "throughout",
        "187": "its",
        "188": "history,8]",
        "189": "followed",
        "190": "by",
        "191": "periods",
        "192": "disappointment",
        "193": "loss",
        "194": "funding,",
        "195": "known",
        "196": "winters.10]",
        "197": "funding",
        "198": "interest",
        "199": "vastly",
        "200": "increased",
        "201": "after",
        "202": "2012",
        "203": "when",
        "204": "graphics",
        "205": "processing",
        "206": "units",
        "207": "started",
        "208": "used",
        "209": "accelerate",
        "210": "deep",
        "211": "outperformed",
        "212": "previous",
        "213": "techniques.[11]",
        "214": "this",
        "215": "growth",
        "216": "accelerated",
        "217": "further",
        "218": "2017",
        "219": "transformer",
        "220": "architecture.[12]",
        "221": "2020s,",
        "222": "ongoing",
        "223": "period",
        "224": "rapid",
        "225": "progress",
        "226": "became",
        "227": "boom.",
        "228": "ai's",
        "229": "ability",
        "230": "modify",
        "231": "content",
        "232": "led",
        "233": "several",
        "234": "unintended",
        "235": "consequences",
        "236": "harms.",
        "237": "ethical",
        "238": "concerns",
        "239": "been",
        "240": "raised",
        "241": "about",
        "242": "long-term",
        "243": "effects",
        "244": "potential",
        "245": "existential",
        "246": "risks,",
        "247": "prompting",
        "248": "discussions",
        "249": "regulatory",
        "250": "policies",
        "251": "ensure",
        "252": "safety",
        "253": "benefits",
        "254": "technology.",
        "255": "he",
        "256": "problem",
        "257": "simulating",
        "258": "broken",
        "259": "subproblems.",
        "260": "consist",
        "261": "traits",
        "262": "or",
        "263": "capabilities",
        "264": "expect",
        "265": "intelligent",
        "266": "system",
        "267": "display.",
        "268": "described",
        "269": "below",
        "270": "received",
        "271": "most",
        "272": "attention",
        "273": "cover",
        "274": "scope",
        "275": "research.[a]",
        "276": "reasoning",
        "277": "problem-solving",
        "278": "early",
        "279": "developed",
        "280": "algorithms",
        "281": "imitated",
        "282": "step-by-step",
        "283": "humans",
        "284": "they",
        "285": "solve",
        "286": "puzzles",
        "287": "make",
        "288": "logical",
        "289": "deductions.[13]",
        "290": "late",
        "291": "1980s",
        "292": "1990s,",
        "293": "were",
        "294": "dealing",
        "295": "uncertain",
        "296": "incomplete",
        "297": "information,",
        "298": "employing",
        "299": "concepts",
        "300": "from",
        "301": "probability",
        "302": "economics.[14]",
        "303": "insufficient",
        "304": "solving",
        "305": "large",
        "306": "problems",
        "307": "experience",
        "308": "\"combinatorial",
        "309": "explosion\":",
        "310": "become",
        "311": "exponentially",
        "312": "slower",
        "313": "grow.[15]",
        "314": "even",
        "315": "rarely",
        "316": "deduction",
        "317": "could",
        "318": "model.",
        "319": "using",
        "320": "fast,",
        "321": "intuitive",
        "322": "judgments.[16]",
        "323": "accurate",
        "324": "efficient",
        "325": "unsolved",
        "326": "problem."
    },
    "word_freq": {
        "ai\"": 1,
        "redirects": 1,
        "here.": 1,
        "for": 4,
        "other": 2,
        "uses,": 1,
        "see": 1,
        "ai": 16,
        "and": 31,
        "artificial": 5,
        "intelligence": 6,
        ".": 2,
        "is": 3,
        "the": 15,
        "capability": 1,
        "of": 19,
        "computational": 1,
        "systems": 2,
        "to": 10,
        "perform": 1,
        "tasks": 1,
        "typically": 1,
        "associated": 1,
        "with": 3,
        "human": 1,
        "intelligence,": 1,
        "such": 2,
        "as": 9,
        "learning,": 2,
        "reasoning,": 2,
        "problem-solving,": 1,
        "perception,": 2,
        "decision-making.": 1,
        "it": 1,
        "a": 4,
        "field": 2,
        "research": 4,
        "in": 5,
        "computer": 1,
        "science": 1,
        "that": 8,
        "develops": 1,
        "studies": 1,
        "methods": 3,
        "software": 1,
        "enable": 1,
        "machines": 1,
        "perceive": 1,
        "their": 3,
        "environment": 1,
        "use": 4,
        "learning": 2,
        "take": 1,
        "actions": 1,
        "maximize": 1,
        "chances": 1,
        "achieving": 1,
        "defined": 1,
        "goals.[1]": 1,
        "high-profile": 1,
        "applications": 2,
        "include": 2,
        "advanced": 2,
        "web": 1,
        "search": 2,
        "engines": 1,
        ";": 5,
        "recommendation": 1,
        "virtual": 1,
        "assistants": 1,
        "autonomous": 1,
        "vehicles": 1,
        "generative": 3,
        "creative": 1,
        "tools": 1,
        "superhuman": 1,
        "play": 1,
        "analysis": 1,
        "strategy": 1,
        "games": 1,
        "however,": 1,
        "many": 2,
        "are": 3,
        "not": 2,
        "perceived": 1,
        "ai:": 1,
        "\"a": 1,
        "lot": 1,
        "cutting": 1,
        "edge": 1,
        "has": 3,
        "filtered": 1,
        "into": 2,
        "general": 3,
        "applications,": 1,
        "often": 1,
        "without": 1,
        "being": 2,
        "called": 1,
        "because": 2,
        "once": 1,
        "something": 1,
        "becomes": 1,
        "useful": 1,
        "enough": 2,
        "common": 1,
        "it's": 1,
        "labeled": 1,
        "anymore.\"3]": 1,
        "various": 1,
        "subfields": 1,
        "centered": 1,
        "around": 1,
        "particular": 3,
        "goals": 2,
        "tools.": 1,
        "traditional": 1,
        "knowledge": 1,
        "representation,": 1,
        "planning,": 1,
        "natural": 1,
        "language": 1,
        "processing,": 1,
        "support": 1,
        "robotics.[a]": 1,
        "reach": 1,
        "these": 3,
        "goals,": 1,
        "researchers": 3,
        "have": 3,
        "adapted": 1,
        "integrated": 1,
        "wide": 1,
        "range": 1,
        "techniques,": 1,
        "including": 1,
        "mathematical": 1,
        "optimization,": 1,
        "formal": 1,
        "logic,": 1,
        "neural": 2,
        "networks,": 2,
        "based": 1,
        "on": 1,
        "statistics,": 1,
        "operations": 1,
        "research,": 1,
        "economics.[b]": 1,
        "also": 1,
        "draws": 1,
        "upon": 1,
        "psychology,": 1,
        "linguistics,": 1,
        "philosophy,": 1,
        "neuroscience,": 1,
        "fields.[4]": 1,
        "some": 1,
        "companies,": 1,
        "openai,": 1,
        "google": 1,
        "deepmind": 1,
        "meta,[5]": 1,
        "aim": 1,
        "create": 2,
        "\u2014ai": 1,
        "can": 1,
        "complete": 1,
        "virtually": 1,
        "any": 1,
        "cognitive": 1,
        "task": 1,
        "at": 1,
        "least": 1,
        "well": 1,
        "human.": 1,
        "was": 1,
        "founded": 1,
        "an": 4,
        "academic": 1,
        "discipline": 1,
        "1956,[6]": 1,
        "went": 1,
        "through": 1,
        "multiple": 1,
        "cycles": 1,
        "optimism": 1,
        "throughout": 1,
        "its": 1,
        "history,8]": 1,
        "followed": 1,
        "by": 2,
        "periods": 1,
        "disappointment": 1,
        "loss": 1,
        "funding,": 1,
        "known": 2,
        "winters.10]": 1,
        "funding": 1,
        "interest": 1,
        "vastly": 1,
        "increased": 1,
        "after": 2,
        "2012": 1,
        "when": 2,
        "graphics": 1,
        "processing": 1,
        "units": 1,
        "started": 1,
        "used": 1,
        "accelerate": 1,
        "deep": 1,
        "outperformed": 1,
        "previous": 1,
        "techniques.[11]": 1,
        "this": 1,
        "growth": 1,
        "accelerated": 1,
        "further": 1,
        "2017": 1,
        "transformer": 1,
        "architecture.[12]": 1,
        "2020s,": 1,
        "ongoing": 1,
        "period": 1,
        "rapid": 1,
        "progress": 1,
        "became": 1,
        "boom.": 1,
        "ai's": 2,
        "ability": 1,
        "modify": 1,
        "content": 1,
        "led": 1,
        "several": 1,
        "unintended": 1,
        "consequences": 1,
        "harms.": 1,
        "ethical": 1,
        "concerns": 1,
        "been": 2,
        "raised": 1,
        "about": 2,
        "long-term": 1,
        "effects": 1,
        "potential": 1,
        "existential": 1,
        "risks,": 1,
        "prompting": 1,
        "discussions": 1,
        "regulatory": 1,
        "policies": 1,
        "ensure": 1,
        "safety": 1,
        "benefits": 1,
        "technology.": 1,
        "he": 1,
        "problem": 1,
        "simulating": 1,
        "broken": 1,
        "subproblems.": 1,
        "consist": 1,
        "traits": 2,
        "or": 3,
        "capabilities": 1,
        "expect": 1,
        "intelligent": 1,
        "system": 1,
        "display.": 1,
        "described": 1,
        "below": 1,
        "received": 1,
        "most": 2,
        "attention": 1,
        "cover": 1,
        "scope": 1,
        "research.[a]": 1,
        "reasoning": 4,
        "problem-solving": 1,
        "early": 2,
        "developed": 2,
        "algorithms": 2,
        "imitated": 1,
        "step-by-step": 2,
        "humans": 2,
        "they": 4,
        "solve": 2,
        "puzzles": 1,
        "make": 1,
        "logical": 1,
        "deductions.[13]": 1,
        "late": 1,
        "1980s": 1,
        "1990s,": 1,
        "were": 1,
        "dealing": 1,
        "uncertain": 1,
        "incomplete": 1,
        "information,": 1,
        "employing": 1,
        "concepts": 1,
        "from": 1,
        "probability": 1,
        "economics.[14]": 1,
        "insufficient": 1,
        "solving": 1,
        "large": 1,
        "problems": 3,
        "experience": 1,
        "\"combinatorial": 1,
        "explosion\":": 1,
        "become": 1,
        "exponentially": 1,
        "slower": 1,
        "grow.[15]": 1,
        "even": 1,
        "rarely": 1,
        "deduction": 1,
        "could": 1,
        "model.": 1,
        "using": 1,
        "fast,": 1,
        "intuitive": 1,
        "judgments.[16]": 1,
        "accurate": 1,
        "efficient": 1,
        "unsolved": 1,
        "problem.": 1
    }
}