{
    "word_to_id": {
        "ai": 0,
        "redirects": 1,
        "here": 2,
        "for": 3,
        "other": 4,
        "uses": 5,
        "see": 6,
        "disambiguation": 7,
        "and": 8,
        "artificial": 9,
        "intelligence": 10,
        "is": 11,
        "the": 12,
        "capability": 13,
        "of": 14,
        "computational": 15,
        "systems": 16,
        "to": 17,
        "perform": 18,
        "tasks": 19,
        "typically": 20,
        "associated": 21,
        "with": 22,
        "human": 23,
        "such": 24,
        "as": 25,
        "learning": 26,
        "reasoning": 27,
        "problemsolving": 28,
        "perception": 29,
        "decisionmaking": 30,
        "it": 31,
        "a": 32,
        "field": 33,
        "research": 34,
        "in": 35,
        "computer": 36,
        "science": 37,
        "that": 38,
        "develops": 39,
        "studies": 40,
        "methods": 41,
        "software": 42,
        "enable": 43,
        "machines": 44,
        "perceive": 45,
        "their": 46,
        "environment": 47,
        "use": 48,
        "take": 49,
        "actions": 50,
        "maximize": 51,
        "chances": 52,
        "achieving": 53,
        "defined": 54,
        "goals1": 55,
        "highprofile": 56,
        "applications": 57,
        "include": 58,
        "advanced": 59,
        "web": 60,
        "search": 61,
        "engines": 62,
        "eg": 63,
        "google": 64,
        "recommendation": 65,
        "used": 66,
        "by": 67,
        "youtube": 68,
        "amazon": 69,
        "netflix": 70,
        "virtual": 71,
        "assistants": 72,
        "assistant": 73,
        "siri": 74,
        "alexa": 75,
        "autonomous": 76,
        "vehicles": 77,
        "waymo": 78,
        "generative": 79,
        "creative": 80,
        "tools": 81,
        "language": 82,
        "models": 83,
        "art": 84,
        "superhuman": 85,
        "play": 86,
        "analysis": 87,
        "strategy": 88,
        "games": 89,
        "chess": 90,
        "go": 91,
        "however": 92,
        "many": 93,
        "are": 94,
        "not": 95,
        "perceived": 96,
        "lot": 97,
        "cutting": 98,
        "edge": 99,
        "has": 100,
        "filtered": 101,
        "into": 102,
        "general": 103,
        "often": 104,
        "without": 105,
        "being": 106,
        "called": 107,
        "because": 108,
        "once": 109,
        "something": 110,
        "becomes": 111,
        "useful": 112,
        "enough": 113,
        "common": 114,
        "its": 115,
        "labeled": 116,
        "anymore23": 117,
        "various": 118,
        "subfields": 119,
        "centered": 120,
        "around": 121,
        "particular": 122,
        "goals": 123,
        "traditional": 124,
        "knowledge": 125,
        "representation": 126,
        "planning": 127,
        "natural": 128,
        "processing": 129,
        "support": 130,
        "roboticsa": 131,
        "reach": 132,
        "these": 133,
        "researchers": 134,
        "have": 135,
        "adapted": 136,
        "integrated": 137,
        "wide": 138,
        "range": 139,
        "techniques": 140,
        "including": 141,
        "mathematical": 142,
        "optimization": 143,
        "formal": 144,
        "logic": 145,
        "neural": 146,
        "networks": 147,
        "based": 148,
        "on": 149,
        "statistics": 150,
        "operations": 151,
        "economicsb": 152,
        "also": 153,
        "draws": 154,
        "upon": 155,
        "psychology": 156,
        "linguistics": 157,
        "philosophy": 158,
        "neuroscience": 159,
        "fields4": 160,
        "some": 161,
        "companies": 162,
        "openai": 163,
        "deepmind": 164,
        "meta5": 165,
        "aim": 166,
        "create": 167,
        "agiai": 168,
        "can": 169,
        "complete": 170,
        "virtually": 171,
        "any": 172,
        "cognitive": 173,
        "task": 174,
        "at": 175,
        "least": 176,
        "well": 177,
        "was": 178,
        "founded": 179,
        "an": 180,
        "academic": 181,
        "discipline": 182,
        "19566": 183,
        "went": 184,
        "through": 185,
        "multiple": 186,
        "cycles": 187,
        "optimism": 188,
        "throughout": 189,
        "history78": 190,
        "followed": 191,
        "periods": 192,
        "disappointment": 193,
        "loss": 194,
        "funding": 195,
        "known": 196,
        "winters910": 197,
        "interest": 198,
        "vastly": 199,
        "increased": 200,
        "after": 201,
        "2012": 202,
        "when": 203,
        "graphics": 204,
        "units": 205,
        "started": 206,
        "accelerate": 207,
        "deep": 208,
        "outperformed": 209,
        "previous": 210,
        "techniques11": 211,
        "this": 212,
        "growth": 213,
        "accelerated": 214,
        "further": 215,
        "2017": 216,
        "transformer": 217,
        "architecture12": 218,
        "2020s": 219,
        "ongoing": 220,
        "period": 221,
        "rapid": 222,
        "progress": 223,
        "became": 224,
        "boom": 225,
        "ais": 226,
        "ability": 227,
        "modify": 228,
        "content": 229,
        "led": 230,
        "several": 231,
        "unintended": 232,
        "consequences": 233,
        "harms": 234,
        "ethical": 235,
        "concerns": 236,
        "been": 237,
        "raised": 238,
        "about": 239,
        "longterm": 240,
        "effects": 241,
        "potential": 242,
        "existential": 243,
        "risks": 244,
        "prompting": 245,
        "discussions": 246,
        "regulatory": 247,
        "policies": 248,
        "ensure": 249,
        "safety": 250,
        "benefits": 251,
        "technology": 252,
        "he": 253,
        "problem": 254,
        "simulating": 255,
        "or": 256,
        "creating": 257,
        "broken": 258,
        "subproblems": 259,
        "consist": 260,
        "traits": 261,
        "capabilities": 262,
        "expect": 263,
        "intelligent": 264,
        "system": 265,
        "display": 266,
        "described": 267,
        "below": 268,
        "received": 269,
        "most": 270,
        "attention": 271,
        "cover": 272,
        "scope": 273,
        "researcha": 274,
        "early": 275,
        "developed": 276,
        "algorithms": 277,
        "imitated": 278,
        "stepbystep": 279,
        "humans": 280,
        "they": 281,
        "solve": 282,
        "puzzles": 283,
        "make": 284,
        "logical": 285,
        "deductions13": 286,
        "late": 287,
        "1980s": 288,
        "1990s": 289,
        "were": 290,
        "dealing": 291,
        "uncertain": 292,
        "incomplete": 293,
        "information": 294,
        "employing": 295,
        "concepts": 296,
        "from": 297,
        "probability": 298,
        "economics14": 299,
        "insufficient": 300,
        "solving": 301,
        "large": 302,
        "problems": 303,
        "experience": 304,
        "combinatorial": 305,
        "explosion": 306,
        "become": 307,
        "exponentially": 308,
        "slower": 309,
        "grow15": 310,
        "even": 311,
        "rarely": 312,
        "deduction": 313,
        "could": 314,
        "model": 315,
        "using": 316,
        "fast": 317,
        "intuitive": 318,
        "judgments16": 319,
        "accurate": 320,
        "efficient": 321,
        "unsolved": 322
    },
    "id_to_word": {
        "0": "ai",
        "1": "redirects",
        "2": "here",
        "3": "for",
        "4": "other",
        "5": "uses",
        "6": "see",
        "7": "disambiguation",
        "8": "and",
        "9": "artificial",
        "10": "intelligence",
        "11": "is",
        "12": "the",
        "13": "capability",
        "14": "of",
        "15": "computational",
        "16": "systems",
        "17": "to",
        "18": "perform",
        "19": "tasks",
        "20": "typically",
        "21": "associated",
        "22": "with",
        "23": "human",
        "24": "such",
        "25": "as",
        "26": "learning",
        "27": "reasoning",
        "28": "problemsolving",
        "29": "perception",
        "30": "decisionmaking",
        "31": "it",
        "32": "a",
        "33": "field",
        "34": "research",
        "35": "in",
        "36": "computer",
        "37": "science",
        "38": "that",
        "39": "develops",
        "40": "studies",
        "41": "methods",
        "42": "software",
        "43": "enable",
        "44": "machines",
        "45": "perceive",
        "46": "their",
        "47": "environment",
        "48": "use",
        "49": "take",
        "50": "actions",
        "51": "maximize",
        "52": "chances",
        "53": "achieving",
        "54": "defined",
        "55": "goals1",
        "56": "highprofile",
        "57": "applications",
        "58": "include",
        "59": "advanced",
        "60": "web",
        "61": "search",
        "62": "engines",
        "63": "eg",
        "64": "google",
        "65": "recommendation",
        "66": "used",
        "67": "by",
        "68": "youtube",
        "69": "amazon",
        "70": "netflix",
        "71": "virtual",
        "72": "assistants",
        "73": "assistant",
        "74": "siri",
        "75": "alexa",
        "76": "autonomous",
        "77": "vehicles",
        "78": "waymo",
        "79": "generative",
        "80": "creative",
        "81": "tools",
        "82": "language",
        "83": "models",
        "84": "art",
        "85": "superhuman",
        "86": "play",
        "87": "analysis",
        "88": "strategy",
        "89": "games",
        "90": "chess",
        "91": "go",
        "92": "however",
        "93": "many",
        "94": "are",
        "95": "not",
        "96": "perceived",
        "97": "lot",
        "98": "cutting",
        "99": "edge",
        "100": "has",
        "101": "filtered",
        "102": "into",
        "103": "general",
        "104": "often",
        "105": "without",
        "106": "being",
        "107": "called",
        "108": "because",
        "109": "once",
        "110": "something",
        "111": "becomes",
        "112": "useful",
        "113": "enough",
        "114": "common",
        "115": "its",
        "116": "labeled",
        "117": "anymore23",
        "118": "various",
        "119": "subfields",
        "120": "centered",
        "121": "around",
        "122": "particular",
        "123": "goals",
        "124": "traditional",
        "125": "knowledge",
        "126": "representation",
        "127": "planning",
        "128": "natural",
        "129": "processing",
        "130": "support",
        "131": "roboticsa",
        "132": "reach",
        "133": "these",
        "134": "researchers",
        "135": "have",
        "136": "adapted",
        "137": "integrated",
        "138": "wide",
        "139": "range",
        "140": "techniques",
        "141": "including",
        "142": "mathematical",
        "143": "optimization",
        "144": "formal",
        "145": "logic",
        "146": "neural",
        "147": "networks",
        "148": "based",
        "149": "on",
        "150": "statistics",
        "151": "operations",
        "152": "economicsb",
        "153": "also",
        "154": "draws",
        "155": "upon",
        "156": "psychology",
        "157": "linguistics",
        "158": "philosophy",
        "159": "neuroscience",
        "160": "fields4",
        "161": "some",
        "162": "companies",
        "163": "openai",
        "164": "deepmind",
        "165": "meta5",
        "166": "aim",
        "167": "create",
        "168": "agiai",
        "169": "can",
        "170": "complete",
        "171": "virtually",
        "172": "any",
        "173": "cognitive",
        "174": "task",
        "175": "at",
        "176": "least",
        "177": "well",
        "178": "was",
        "179": "founded",
        "180": "an",
        "181": "academic",
        "182": "discipline",
        "183": "19566",
        "184": "went",
        "185": "through",
        "186": "multiple",
        "187": "cycles",
        "188": "optimism",
        "189": "throughout",
        "190": "history78",
        "191": "followed",
        "192": "periods",
        "193": "disappointment",
        "194": "loss",
        "195": "funding",
        "196": "known",
        "197": "winters910",
        "198": "interest",
        "199": "vastly",
        "200": "increased",
        "201": "after",
        "202": "2012",
        "203": "when",
        "204": "graphics",
        "205": "units",
        "206": "started",
        "207": "accelerate",
        "208": "deep",
        "209": "outperformed",
        "210": "previous",
        "211": "techniques11",
        "212": "this",
        "213": "growth",
        "214": "accelerated",
        "215": "further",
        "216": "2017",
        "217": "transformer",
        "218": "architecture12",
        "219": "2020s",
        "220": "ongoing",
        "221": "period",
        "222": "rapid",
        "223": "progress",
        "224": "became",
        "225": "boom",
        "226": "ais",
        "227": "ability",
        "228": "modify",
        "229": "content",
        "230": "led",
        "231": "several",
        "232": "unintended",
        "233": "consequences",
        "234": "harms",
        "235": "ethical",
        "236": "concerns",
        "237": "been",
        "238": "raised",
        "239": "about",
        "240": "longterm",
        "241": "effects",
        "242": "potential",
        "243": "existential",
        "244": "risks",
        "245": "prompting",
        "246": "discussions",
        "247": "regulatory",
        "248": "policies",
        "249": "ensure",
        "250": "safety",
        "251": "benefits",
        "252": "technology",
        "253": "he",
        "254": "problem",
        "255": "simulating",
        "256": "or",
        "257": "creating",
        "258": "broken",
        "259": "subproblems",
        "260": "consist",
        "261": "traits",
        "262": "capabilities",
        "263": "expect",
        "264": "intelligent",
        "265": "system",
        "266": "display",
        "267": "described",
        "268": "below",
        "269": "received",
        "270": "most",
        "271": "attention",
        "272": "cover",
        "273": "scope",
        "274": "researcha",
        "275": "early",
        "276": "developed",
        "277": "algorithms",
        "278": "imitated",
        "279": "stepbystep",
        "280": "humans",
        "281": "they",
        "282": "solve",
        "283": "puzzles",
        "284": "make",
        "285": "logical",
        "286": "deductions13",
        "287": "late",
        "288": "1980s",
        "289": "1990s",
        "290": "were",
        "291": "dealing",
        "292": "uncertain",
        "293": "incomplete",
        "294": "information",
        "295": "employing",
        "296": "concepts",
        "297": "from",
        "298": "probability",
        "299": "economics14",
        "300": "insufficient",
        "301": "solving",
        "302": "large",
        "303": "problems",
        "304": "experience",
        "305": "combinatorial",
        "306": "explosion",
        "307": "become",
        "308": "exponentially",
        "309": "slower",
        "310": "grow15",
        "311": "even",
        "312": "rarely",
        "313": "deduction",
        "314": "could",
        "315": "model",
        "316": "using",
        "317": "fast",
        "318": "intuitive",
        "319": "judgments16",
        "320": "accurate",
        "321": "efficient",
        "322": "unsolved"
    },
    "word_freq": {
        "ai": 20,
        "redirects": 1,
        "here": 1,
        "for": 4,
        "other": 2,
        "uses": 1,
        "see": 1,
        "disambiguation": 2,
        "and": 35,
        "artificial": 5,
        "intelligence": 7,
        "is": 3,
        "the": 15,
        "capability": 1,
        "of": 19,
        "computational": 1,
        "systems": 2,
        "to": 10,
        "perform": 1,
        "tasks": 1,
        "typically": 1,
        "associated": 1,
        "with": 3,
        "human": 2,
        "such": 2,
        "as": 9,
        "learning": 4,
        "reasoning": 6,
        "problemsolving": 2,
        "perception": 2,
        "decisionmaking": 1,
        "it": 1,
        "a": 5,
        "field": 2,
        "research": 5,
        "in": 5,
        "computer": 1,
        "science": 1,
        "that": 8,
        "develops": 1,
        "studies": 1,
        "methods": 3,
        "software": 1,
        "enable": 1,
        "machines": 1,
        "perceive": 1,
        "their": 3,
        "environment": 1,
        "use": 4,
        "take": 1,
        "actions": 1,
        "maximize": 1,
        "chances": 1,
        "achieving": 1,
        "defined": 1,
        "goals1": 1,
        "highprofile": 1,
        "applications": 3,
        "include": 2,
        "advanced": 2,
        "web": 1,
        "search": 3,
        "engines": 1,
        "eg": 5,
        "google": 3,
        "recommendation": 1,
        "used": 2,
        "by": 3,
        "youtube": 1,
        "amazon": 1,
        "netflix": 1,
        "virtual": 1,
        "assistants": 1,
        "assistant": 1,
        "siri": 1,
        "alexa": 1,
        "autonomous": 1,
        "vehicles": 1,
        "waymo": 1,
        "generative": 3,
        "creative": 1,
        "tools": 2,
        "language": 2,
        "models": 1,
        "art": 1,
        "superhuman": 1,
        "play": 1,
        "analysis": 1,
        "strategy": 1,
        "games": 1,
        "chess": 1,
        "go": 1,
        "however": 1,
        "many": 2,
        "are": 3,
        "not": 2,
        "perceived": 1,
        "lot": 1,
        "cutting": 1,
        "edge": 1,
        "has": 3,
        "filtered": 1,
        "into": 2,
        "general": 3,
        "often": 1,
        "without": 1,
        "being": 2,
        "called": 1,
        "because": 2,
        "once": 1,
        "something": 1,
        "becomes": 1,
        "useful": 1,
        "enough": 2,
        "common": 1,
        "its": 2,
        "labeled": 1,
        "anymore23": 1,
        "various": 1,
        "subfields": 1,
        "centered": 1,
        "around": 1,
        "particular": 3,
        "goals": 3,
        "traditional": 1,
        "knowledge": 1,
        "representation": 1,
        "planning": 1,
        "natural": 1,
        "processing": 2,
        "support": 1,
        "roboticsa": 1,
        "reach": 1,
        "these": 3,
        "researchers": 3,
        "have": 3,
        "adapted": 1,
        "integrated": 1,
        "wide": 1,
        "range": 1,
        "techniques": 1,
        "including": 1,
        "mathematical": 1,
        "optimization": 1,
        "formal": 1,
        "logic": 1,
        "neural": 2,
        "networks": 2,
        "based": 1,
        "on": 1,
        "statistics": 1,
        "operations": 1,
        "economicsb": 1,
        "also": 1,
        "draws": 1,
        "upon": 1,
        "psychology": 1,
        "linguistics": 1,
        "philosophy": 1,
        "neuroscience": 1,
        "fields4": 1,
        "some": 1,
        "companies": 1,
        "openai": 1,
        "deepmind": 1,
        "meta5": 1,
        "aim": 1,
        "create": 2,
        "agiai": 1,
        "can": 1,
        "complete": 1,
        "virtually": 1,
        "any": 1,
        "cognitive": 1,
        "task": 1,
        "at": 1,
        "least": 1,
        "well": 1,
        "was": 1,
        "founded": 1,
        "an": 4,
        "academic": 1,
        "discipline": 1,
        "19566": 1,
        "went": 1,
        "through": 1,
        "multiple": 1,
        "cycles": 1,
        "optimism": 1,
        "throughout": 1,
        "history78": 1,
        "followed": 1,
        "periods": 1,
        "disappointment": 1,
        "loss": 1,
        "funding": 2,
        "known": 2,
        "winters910": 1,
        "interest": 1,
        "vastly": 1,
        "increased": 1,
        "after": 2,
        "2012": 1,
        "when": 2,
        "graphics": 1,
        "units": 1,
        "started": 1,
        "accelerate": 1,
        "deep": 1,
        "outperformed": 1,
        "previous": 1,
        "techniques11": 1,
        "this": 1,
        "growth": 1,
        "accelerated": 1,
        "further": 1,
        "2017": 1,
        "transformer": 1,
        "architecture12": 1,
        "2020s": 1,
        "ongoing": 1,
        "period": 1,
        "rapid": 1,
        "progress": 1,
        "became": 1,
        "boom": 1,
        "ais": 2,
        "ability": 1,
        "modify": 1,
        "content": 1,
        "led": 1,
        "several": 1,
        "unintended": 1,
        "consequences": 1,
        "harms": 1,
        "ethical": 1,
        "concerns": 1,
        "been": 2,
        "raised": 1,
        "about": 2,
        "longterm": 1,
        "effects": 1,
        "potential": 1,
        "existential": 1,
        "risks": 1,
        "prompting": 1,
        "discussions": 1,
        "regulatory": 1,
        "policies": 1,
        "ensure": 1,
        "safety": 1,
        "benefits": 1,
        "technology": 1,
        "he": 1,
        "problem": 2,
        "simulating": 1,
        "or": 4,
        "creating": 1,
        "broken": 1,
        "subproblems": 1,
        "consist": 1,
        "traits": 2,
        "capabilities": 1,
        "expect": 1,
        "intelligent": 1,
        "system": 1,
        "display": 1,
        "described": 1,
        "below": 1,
        "received": 1,
        "most": 2,
        "attention": 1,
        "cover": 1,
        "scope": 1,
        "researcha": 1,
        "early": 2,
        "developed": 2,
        "algorithms": 2,
        "imitated": 1,
        "stepbystep": 2,
        "humans": 2,
        "they": 4,
        "solve": 2,
        "puzzles": 1,
        "make": 1,
        "logical": 1,
        "deductions13": 1,
        "late": 1,
        "1980s": 1,
        "1990s": 1,
        "were": 1,
        "dealing": 1,
        "uncertain": 1,
        "incomplete": 1,
        "information": 1,
        "employing": 1,
        "concepts": 1,
        "from": 1,
        "probability": 1,
        "economics14": 1,
        "insufficient": 1,
        "solving": 1,
        "large": 1,
        "problems": 3,
        "experience": 1,
        "combinatorial": 1,
        "explosion": 1,
        "become": 1,
        "exponentially": 1,
        "slower": 1,
        "grow15": 1,
        "even": 1,
        "rarely": 1,
        "deduction": 1,
        "could": 1,
        "model": 1,
        "using": 1,
        "fast": 1,
        "intuitive": 1,
        "judgments16": 1,
        "accurate": 1,
        "efficient": 1,
        "unsolved": 1
    }
}